views/dotbaoduong/_form.php

SELECT * FROM `tramvt`
SELECT * FROM `nhanvien`
---
        ]
    ]); ?>

    <?= $form->field($model, 'ID_TRAMVT')->dropDownList(ArrayHelper::map(Tramvt::find()->all(), 'ID_TRAM', 'MA_TRAM'));
    ?>

    <?= $form->field($model, 'TRUONG_NHOM')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Nhanvien::find()->all(), 'ID_NHANVIEN', 'TEN_NHANVIEN'),
        'options' => ['placeholder' => 'Chọn nhóm trưởng'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]); ?>