views/dotbaoduong/kehoach.php

            ['class'=>'btn btn-primary']
        )
        . '</div>' ;
    echo TabularForm::widget([
        'form' => $form,
        'dataProvider' => $dataProvider,
        'attributes' => [
            'ID_THIETBI' => [
                'type' => TabularForm::INPUT_DROPDOWN_LIST,
                'items'=>ArrayHelper::map(Thietbitram::find()->all(), 'ID_THIETBI', 'iDLOAITB.TEN_THIETBI'),
            ],
            'MA_NOIDUNG' => [
                'type' => TabularForm::INPUT_DROPDOWN_LIST,
                'items'=>ArrayHelper::map(Noidungbaotri::find()->all(), 'MA_NOIDUNG', 'NOIDUNG')
            ],
            'ID_NHANVIEN' => [
                'type' => TabularForm::INPUT_DROPDOWN_LIST,
                'items'=>ArrayHelper::map(Nhanvien::find()->all(), 'ID_NHANVIEN', 'TEN_NHANVIEN')
            ],
        ],
        'gridSettings' => [
            //'floatHeader' => true,
        ],
        'serialColumn' => false,
        'checkboxColumn' => false,
---
SELECT * FROM `thietbi` WHERE `ID_THIETBI`=1
SELECT * FROM `thietbitram`
SELECT * FROM `nhanvien`
SELECT * FROM `noidungbaotri`